zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA344VLL-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA344VLL/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXA366VLL-pinctrl.h with this part's differences applied
 * below (322 removed, 0 changed,
 * 99 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 011ef572d22de35a
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA344VLL_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXA344VLL_WRAPPER_

#include "MCXA366VLL-pinctrl.h"

/* Signals not present on this part */
#undef ADC2_A0_P2_4
#undef ADC2_A14_P0_14
#undef ADC2_A15_P0_15
#undef ADC2_A18_P4_2
#undef ADC2_A19_P4_3
#undef ADC2_A1_P2_10
#undef ADC2_A20_P4_4
#undef ADC2_A21_P4_5
#undef ADC2_A22_P4_6
#undef ADC2_A23_P4_7
#undef ADC2_A2_P2_6
#undef ADC2_A4_P2_16
#undef ADC2_A5_P2_12
#undef ADC2_A6_P2_20
#undef ADC2_A7_P2_7
#undef ADC2_A8_P0_2
#undef ADC3_A0_P2_5
#undef ADC3_A12_P3_6
#undef ADC3_A13_P3_7
#undef ADC3_A14_P3_12
#undef ADC3_A15_P3_13
#undef ADC3_A16_P3_14
#undef ADC3_A17_P3_15
#undef ADC3_A18_P3_20
#undef ADC3_A19_P3_21
#undef ADC3_A1_P2_11
#undef ADC3_A20_P3_22
#undef ADC3_A2_P2_23
#undef ADC3_A4_P2_17
#undef ADC3_A5_P2_13
#undef ADC3_A6_P2_21
#undef ADC3_A7_P2_7
#undef CAN1_RXD_P1_0
#undef CAN1_RXD_P1_12
#undef CAN1_RXD_P1_7
#undef CAN1_RXD_P2_0
#undef CAN1_RXD_P2_15
#undef CAN1_TXD_P1_1
#undef CAN1_TXD_P1_13
#undef CAN1_TXD_P1_6
#undef CAN1_TXD_P2_1
#undef CAN1_TXD_P2_16
#undef CT3_MAT0_P1_14
#undef CT3_MAT0_P2_16
#undef CT3_MAT1_P1_15
#undef CT3_MAT1_P2_17
#undef CT3_MAT1_P3_27
#undef CT3_MAT2_P2_10
#undef CT3_MAT2_P3_28
#undef CT3_MAT3_P2_11
#undef CT3_MAT3_P2_19
#undef CT3_MAT3_P3_29
#undef CT4_MAT0_P1_6
#undef CT4_MAT0_P2_12
#undef CT4_MAT0_P4_2
#undef CT4_MAT1_P1_7
#undef CT4_MAT1_P2_13
#undef CT4_MAT1_P4_3
#undef CT4_MAT2_P3_6
#undef CT4_MAT2_P4_4
#undef CT4_MAT3_P2_15
#undef CT4_MAT3_P3_7
#undef CT4_MAT3_P4_5
#undef DAC0_OUT_P2_2
#undef FLEXIO0_D0_P0_0
#undef FLEXIO0_D0_P0_16
#undef FLEXIO0_D10_P1_2
#undef FLEXIO0_D10_P2_2
#undef FLEXIO0_D10_P4_2
#undef FLEXIO0_D11_P1_3
#undef FLEXIO0_D11_P2_3
#undef FLEXIO0_D11_P4_3
#undef FLEXIO0_D12_P1_4
#undef FLEXIO0_D12_P2_4
#undef FLEXIO0_D12_P4_4
#undef FLEXIO0_D13_P1_5
#undef FLEXIO0_D13_P2_5
#undef FLEXIO0_D13_P4_5
#undef FLEXIO0_D14_P1_6
#undef FLEXIO0_D14_P2_6
#undef FLEXIO0_D14_P3_6
#undef FLEXIO0_D14_P4_6
#undef FLEXIO0_D15_P1_7
#undef FLEXIO0_D15_P2_7
#undef FLEXIO0_D15_P3_7
#undef FLEXIO0_D15_P4_7
#undef FLEXIO0_D16_P1_8
#undef FLEXIO0_D16_P3_8
#undef FLEXIO0_D17_P1_9
#undef FLEXIO0_D17_P3_9
#undef FLEXIO0_D18_P1_10
#undef FLEXIO0_D18_P2_10
#undef FLEXIO0_D18_P3_10
#undef FLEXIO0_D19_P1_11
#undef FLEXIO0_D19_P2_11
#undef FLEXIO0_D19_P3_11
#undef FLEXIO0_D1_P0_1
#undef FLEXIO0_D1_P0_17
#undef FLEXIO0_D20_P1_12
#undef FLEXIO0_D20_P2_12
#undef FLEXIO0_D20_P3_12
#undef FLEXIO0_D21_P1_13
#undef FLEXIO0_D21_P2_13
#undef FLEXIO0_D21_P3_13
#undef FLEXIO0_D22_P1_14
#undef FLEXIO0_D22_P3_14
#undef FLEXIO0_D23_P1_15
#undef FLEXIO0_D23_P2_15
#undef FLEXIO0_D23_P3_15
#undef FLEXIO0_D24_P2_16
#undef FLEXIO0_D24_P3_16
#undef FLEXIO0_D25_P2_17
#undef FLEXIO0_D25_P3_17
#undef FLEXIO0_D26_P3_18
#undef FLEXIO0_D27_P2_19
#undef FLEXIO0_D27_P3_19
#undef FLEXIO0_D27_P3_27
#undef FLEXIO0_D28_P2_20
#undef FLEXIO0_D28_P3_20
#undef FLEXIO0_D28_P3_28
#undef FLEXIO0_D29_P2_21
#undef FLEXIO0_D29_P3_21
#undef FLEXIO0_D29_P3_29
#undef FLEXIO0_D2_P0_18
#undef FLEXIO0_D2_P0_2
#undef FLEXIO0_D30_P1_30
#undef FLEXIO0_D30_P3_22
#undef FLEXIO0_D30_P3_30
#undef FLEXIO0_D31_P1_31
#undef FLEXIO0_D31_P2_23
#undef FLEXIO0_D31_P3_31
#undef FLEXIO0_D3_P0_19
#undef FLEXIO0_D3_P0_3
#undef FLEXIO0_D4_P0_20
#undef FLEXIO0_D5_P0_21
#undef FLEXIO0_D6_P0_14
#undef FLEXIO0_D6_P0_22
#undef FLEXIO0_D6_P0_6
#undef FLEXIO0_D7_P0_15
#undef FLEXIO0_D7_P0_23
#undef FLEXIO0_D8_P1_0
#undef FLEXIO0_D8_P2_0
#undef FLEXIO0_D8_P3_0
#undef FLEXIO0_D9_P1_1
#undef FLEXIO0_D9_P2_1
#undef FLEXIO0_D9_P3_1
#undef I3C0_PUR_P0_2
#undef I3C0_PUR_P1_11
#undef I3C0_SCL_P0_17
#undef I3C0_SCL_P1_31
#undef I3C0_SCL_P1_9
#undef I3C0_SDA_P0_16
#undef I3C0_SDA_P1_30
#undef I3C0_SDA_P1_8
#undef LCD_P0_P1_0
#undef LCD_P10_P1_12
#undef LCD_P11_P1_13
#undef LCD_P12_P1_14
#undef LCD_P13_P1_15
#undef LCD_P18_P0_14
#undef LCD_P19_P0_15
#undef LCD_P1_P1_1
#undef LCD_P20_P0_16
#undef LCD_P21_P0_17
#undef LCD_P22_P0_18
#undef LCD_P23_P0_19
#undef LCD_P24_P0_20
#undef LCD_P25_P0_21
#undef LCD_P26_P0_22
#undef LCD_P27_P0_23
#undef LCD_P2_P1_2
#undef LCD_P32_P3_0
#undef LCD_P33_P3_1
#undef LCD_P34_P3_6
#undef LCD_P35_P3_7
#undef LCD_P36_P3_8
#undef LCD_P37_P3_9
#undef LCD_P38_P3_10
#undef LCD_P39_P3_11
#undef LCD_P3_P1_3
#undef LCD_P40_P3_12
#undef LCD_P41_P3_13
#undef LCD_P42_P3_14
#undef LCD_P43_P3_15
#undef LCD_P44_P3_16
#undef LCD_P45_P3_17
#undef LCD_P46_P3_18
#undef LCD_P47_P3_19
#undef LCD_P4_P1_6
#undef LCD_P5_P1_7
#undef LCD_P6_P1_8
#undef LCD_P7_P1_9
#undef LCD_P8_P1_10
#undef LCD_P9_P1_11
#undef LCD_VLL1_P1_5
#undef LCD_VLL2_P1_4
#undef LPI2C2_HREQ_P4_6
#undef LPI2C2_SCLS_P1_11
#undef LPI2C2_SCLS_P4_5
#undef LPI2C2_SCL_P1_9
#undef LPI2C2_SCL_P4_3
#undef LPI2C2_SDAS_P1_10
#undef LPI2C2_SDAS_P4_2
#undef LPI2C2_SDA_P1_8
#undef LPI2C2_SDA_P4_4
#undef LPI2C3_HREQ_P3_29
#undef LPI2C3_SCLS_P3_30
#undef LPI2C3_SCL_P3_21
#undef LPI2C3_SCL_P3_27
#undef LPI2C3_SDAS_P3_31
#undef LPI2C3_SDA_P3_20
#undef LPI2C3_SDA_P3_28
#undef LPUART4_CTS_B_P2_0
#undef LPUART4_CTS_B_P3_17
#undef LPUART4_CTS_B_P3_31
#undef LPUART4_RTS_B_P2_1
#undef LPUART4_RTS_B_P3_16
#undef LPUART4_RTS_B_P3_30
#undef LPUART4_RXD_P2_6
#undef LPUART4_RXD_P3_18
#undef LPUART4_RXD_P3_28
#undef LPUART4_RXD_P4_4
#undef LPUART4_TXD_P2_7
#undef LPUART4_TXD_P3_19
#undef LPUART4_TXD_P3_27
#undef LPUART4_TXD_P4_3
#undef LPUART5_CTS_B_P1_12
#undef LPUART5_CTS_B_P3_8
#undef LPUART5_RTS_B_P1_13
#undef LPUART5_RTS_B_P3_9
#undef LPUART5_RXD_P1_11
#undef LPUART5_RXD_P3_11
#undef LPUART5_TXD_P1_10
#undef LPUART5_TXD_P3_10
#undef OPAMP3_INN_P2_21
#undef OPAMP3_INP_P2_20
#undef OPAMP3_OUT_P2_23
#undef SmartDMA_PIO0_P1_4
#undef SmartDMA_PIO0_P3_0
#undef SmartDMA_PIO10_P0_20
#undef SmartDMA_PIO10_P1_14
#undef SmartDMA_PIO10_P3_10
#undef SmartDMA_PIO11_P0_21
#undef SmartDMA_PIO11_P1_15
#undef SmartDMA_PIO11_P3_11
#undef SmartDMA_PIO12_P0_22
#undef SmartDMA_PIO12_P3_12
#undef SmartDMA_PIO13_P0_23
#undef SmartDMA_PIO13_P3_13
#undef SmartDMA_PIO14_P2_10
#undef SmartDMA_PIO14_P3_14
#undef SmartDMA_PIO15_P2_11
#undef SmartDMA_PIO15_P3_15
#undef SmartDMA_PIO16_P2_12
#undef SmartDMA_PIO16_P3_16
#undef SmartDMA_PIO17_P2_13
#undef SmartDMA_PIO17_P3_17
#undef SmartDMA_PIO18_P2_15
#undef SmartDMA_PIO18_P3_18
#undef SmartDMA_PIO19_P2_16
#undef SmartDMA_PIO19_P3_19
#undef SmartDMA_PIO1_P1_5
#undef SmartDMA_PIO1_P3_1
#undef SmartDMA_PIO20_P2_17
#undef SmartDMA_PIO20_P3_20
#undef SmartDMA_PIO21_P2_19
#undef SmartDMA_PIO21_P3_21
#undef SmartDMA_PIO22_P2_20
#undef SmartDMA_PIO22_P3_22
#undef SmartDMA_PIO22_P4_2
#undef SmartDMA_PIO23_P2_21
#undef SmartDMA_PIO23_P4_3
#undef SmartDMA_PIO24_P2_0
#undef SmartDMA_PIO24_P4_4
#undef SmartDMA_PIO25_P2_1
#undef SmartDMA_PIO25_P4_5
#undef SmartDMA_PIO26_P2_2
#undef SmartDMA_PIO26_P4_6
#undef SmartDMA_PIO27_P2_3
#undef SmartDMA_PIO27_P3_27
#undef SmartDMA_PIO27_P4_7
#undef SmartDMA_PIO28_P2_4
#undef SmartDMA_PIO28_P3_28
#undef SmartDMA_PIO29_P2_5
#undef SmartDMA_PIO29_P3_29
#undef SmartDMA_PIO2_P0_6
#undef SmartDMA_PIO2_P1_6
#undef SmartDMA_PIO30_P2_6
#undef SmartDMA_PIO30_P3_30
#undef SmartDMA_PIO31_P2_7
#undef SmartDMA_PIO31_P3_31
#undef SmartDMA_PIO3_P1_7
#undef SmartDMA_PIO4_P0_14
#undef SmartDMA_PIO4_P1_8
#undef SmartDMA_PIO5_P0_15
#undef SmartDMA_PIO5_P1_9
#undef SmartDMA_PIO6_P0_16
#undef SmartDMA_PIO6_P1_10
#undef SmartDMA_PIO6_P3_6
#undef SmartDMA_PIO7_P0_17
#undef SmartDMA_PIO7_P1_11
#undef SmartDMA_PIO7_P3_7
#undef SmartDMA_PIO8_P0_18
#undef SmartDMA_PIO8_P1_12
#undef SmartDMA_PIO8_P3_8
#undef SmartDMA_PIO9_P0_19
#undef SmartDMA_PIO9_P1_13
#undef SmartDMA_PIO9_P3_9
#undef TAMPER0_P3_31
#undef TAMPER1_P3_29
#undef TAMPER4_P3_19
#undef TAMPER5_P3_18
#undef TRIG_IN0
#undef TRIG_IN1
#undef TRIG_IN11
#undef TRIG_IN2
#undef TRIG_IN3
#undef TRIG_IN4
#undef TRIG_IN5
#undef TRIG_IN6
#undef TRIG_IN7
#undef USB0_VBUS_DET_P2_12

/* Signals specific to this part */
#define CAN0_RXD_P1_12 A15X_MUX('1',12,11)
#define CAN0_RXD_P1_7 A15X_MUX('1',7,11)
#define CAN0_TXD_P1_13 A15X_MUX('1',13,11)
#define CAN0_TXD_P1_6 A15X_MUX('1',6,11)
#define CMP0_INP4_P2_15 A15X_MUX('2',15,0)
#define CMP1_INN4_P2_2 A15X_MUX('2',2,0)
#define CMP1_INP4_P2_19 A15X_MUX('2',19,0)
#define CMP2_INN4_P2_2 A15X_MUX('2',2,0)
#define CMP2_INP4_P2_6 A15X_MUX('2',6,0)
#define CT_INP10_P2_26 A15X_MUX('2',26,4)
#define CT_INP8_P2_24 A15X_MUX('2',24,4)
#define CT_INP9_P2_25 A15X_MUX('2',25,4)
#define ISPMODE_N_P3_29 A15X_MUX('3',29,1)
#define LPI2C0_SCLS_P1_11 A15X_MUX('1',11,3)
#define LPI2C0_SCL_P1_9 A15X_MUX('1',9,3)
#define LPI2C0_SDAS_P1_10 A15X_MUX('1',10,3)
#define LPI2C0_SDA_P1_8 A15X_MUX('1',8,3)
#define LPI2C1_HREQ_P3_29 A15X_MUX('3',29,2)
#define LPI2C1_SCLS_P3_30 A15X_MUX('3',30,2)
#define LPI2C1_SCL_P3_27 A15X_MUX('3',27,2)
#define LPI2C1_SDAS_P3_31 A15X_MUX('3',31,2)
#define LPI2C1_SDA_P3_28 A15X_MUX('3',28,2)
#define P2_24 A15X_MUX('2',24,0)
#define P2_25 A15X_MUX('2',25,0)
#define P2_26 A15X_MUX('2',26,0)
#define SMARTDMA_PIO0_P1_4 A15X_MUX('1',4,7)
#define SMARTDMA_PIO0_P3_0 A15X_MUX('3',0,10)
#define SMARTDMA_PIO10_P0_20 A15X_MUX('0',20,7)
#define SMARTDMA_PIO10_P1_14 A15X_MUX('1',14,7)
#define SMARTDMA_PIO10_P3_10 A15X_MUX('3',10,10)
#define SMARTDMA_PIO11_P0_21 A15X_MUX('0',21,7)
#define SMARTDMA_PIO11_P1_15 A15X_MUX('1',15,7)
#define SMARTDMA_PIO11_P3_11 A15X_MUX('3',11,10)
#define SMARTDMA_PIO12_P0_22 A15X_MUX('0',22,7)
#define SMARTDMA_PIO12_P3_12 A15X_MUX('3',12,10)
#define SMARTDMA_PIO13_P0_23 A15X_MUX('0',23,7)
#define SMARTDMA_PIO13_P3_13 A15X_MUX('3',13,10)
#define SMARTDMA_PIO14_P2_10 A15X_MUX('2',10,7)
#define SMARTDMA_PIO14_P3_14 A15X_MUX('3',14,10)
#define SMARTDMA_PIO15_P2_11 A15X_MUX('2',11,7)
#define SMARTDMA_PIO15_P3_15 A15X_MUX('3',15,10)
#define SMARTDMA_PIO16_P2_12 A15X_MUX('2',12,7)
#define SMARTDMA_PIO16_P3_16 A15X_MUX('3',16,10)
#define SMARTDMA_PIO17_P2_13 A15X_MUX('2',13,7)
#define SMARTDMA_PIO17_P3_17 A15X_MUX('3',17,10)
#define SMARTDMA_PIO18_P2_15 A15X_MUX('2',15,7)
#define SMARTDMA_PIO18_P3_18 A15X_MUX('3',18,10)
#define SMARTDMA_PIO19_P2_16 A15X_MUX('2',16,7)
#define SMARTDMA_PIO19_P3_19 A15X_MUX('3',19,10)
#define SMARTDMA_PIO1_P1_5 A15X_MUX('1',5,7)
#define SMARTDMA_PIO1_P3_1 A15X_MUX('3',1,10)
#define SMARTDMA_PIO20_P2_17 A15X_MUX('2',17,7)
#define SMARTDMA_PIO20_P3_20 A15X_MUX('3',20,10)
#define SMARTDMA_PIO21_P2_19 A15X_MUX('2',19,7)
#define SMARTDMA_PIO21_P3_21 A15X_MUX('3',21,10)
#define SMARTDMA_PIO22_P2_20 A15X_MUX('2',20,7)
#define SMARTDMA_PIO22_P3_22 A15X_MUX('3',22,10)
#define SMARTDMA_PIO22_P4_2 A15X_MUX('4',2,7)
#define SMARTDMA_PIO23_P2_21 A15X_MUX('2',21,7)
#define SMARTDMA_PIO23_P4_3 A15X_MUX('4',3,7)
#define SMARTDMA_PIO24_P2_0 A15X_MUX('2',0,7)
#define SMARTDMA_PIO24_P4_4 A15X_MUX('4',4,7)
#define SMARTDMA_PIO25_P2_1 A15X_MUX('2',1,7)
#define SMARTDMA_PIO25_P4_5 A15X_MUX('4',5,7)
#define SMARTDMA_PIO26_P2_2 A15X_MUX('2',2,7)
#define SMARTDMA_PIO26_P4_6 A15X_MUX('4',6,7)
#define SMARTDMA_PIO27_P2_3 A15X_MUX('2',3,7)
#define SMARTDMA_PIO27_P3_27 A15X_MUX('3',27,10)
#define SMARTDMA_PIO27_P4_7 A15X_MUX('4',7,7)
#define SMARTDMA_PIO28_P2_4 A15X_MUX('2',4,7)
#define SMARTDMA_PIO28_P3_28 A15X_MUX('3',28,10)
#define SMARTDMA_PIO29_P2_5 A15X_MUX('2',5,7)
#define SMARTDMA_PIO29_P3_29 A15X_MUX('3',29,10)
#define SMARTDMA_PIO2_P0_6 A15X_MUX('0',6,7)
#define SMARTDMA_PIO2_P1_6 A15X_MUX('1',6,7)
#define SMARTDMA_PIO30_P2_6 A15X_MUX('2',6,7)
#define SMARTDMA_PIO30_P3_30 A15X_MUX('3',30,10)
#define SMARTDMA_PIO31_P2_7 A15X_MUX('2',7,7)
#define SMARTDMA_PIO31_P3_31 A15X_MUX('3',31,10)
#define SMARTDMA_PIO3_P1_7 A15X_MUX('1',7,7)
#define SMARTDMA_PIO4_P0_14 A15X_MUX('0',14,7)
#define SMARTDMA_PIO4_P1_8 A15X_MUX('1',8,7)
#define SMARTDMA_PIO5_P0_15 A15X_MUX('0',15,7)
#define SMARTDMA_PIO5_P1_9 A15X_MUX('1',9,7)
#define SMARTDMA_PIO6_P0_16 A15X_MUX('0',16,7)
#define SMARTDMA_PIO6_P1_10 A15X_MUX('1',10,7)
#define SMARTDMA_PIO6_P3_6 A15X_MUX('3',6,10)
#define SMARTDMA_PIO7_P0_17 A15X_MUX('0',17,7)
#define SMARTDMA_PIO7_P1_11 A15X_MUX('1',11,7)
#define SMARTDMA_PIO7_P3_7 A15X_MUX('3',7,10)
#define SMARTDMA_PIO8_P0_18 A15X_MUX('0',18,7)
#define SMARTDMA_PIO8_P1_12 A15X_MUX('1',12,7)
#define SMARTDMA_PIO8_P3_8 A15X_MUX('3',8,10)
#define SMARTDMA_PIO9_P0_19 A15X_MUX('0',19,7)
#define SMARTDMA_PIO9_P1_13 A15X_MUX('1',13,7)
#define SMARTDMA_PIO9_P3_9 A15X_MUX('3',9,10)
#define TRIG_IN5_P2_26 A15X_MUX('2',26,1)
#define TRIG_OUT6_P2_24 A15X_MUX('2',24,1)
#define TRIG_OUT7_P2_25 A15X_MUX('2',25,1)

#endif /* _ZEPHYR_DTS_BINDING_MCXA344VLL_WRAPPER_ */
